IdeaRS.OpenModel.Detail.LineSupport
Line support

IdeaRS.OpenModel.Detail.LineSupport.#ctor
constructor

IdeaRS.OpenModel.Detail.LineSupport.Name
Gets or set the name

IdeaRS.OpenModel.Detail.LineSupport.X
displacement in X

IdeaRS.OpenModel.Detail.LineSupport.Y
displacement in Y

IdeaRS.OpenModel.Detail.LineSupport.Rz
rotation Rz

IdeaRS.OpenModel.Detail.LineSupport.IsUserStiffnessX
true for user stiffness

IdeaRS.OpenModel.Detail.LineSupport.StiffnessX
support stiffness X

IdeaRS.OpenModel.Detail.LineSupport.IsUserStiffnessY
true for user stiffness

IdeaRS.OpenModel.Detail.LineSupport.StiffnessY
support stiffness Y

IdeaRS.OpenModel.Detail.LineSupport.IsPressureOnlyY
pressure only for Y

IdeaRS.OpenModel.Detail.LineSupport.StiffnessRz
support stiffness Rz

IdeaRS.OpenModel.Detail.LineSupport.Direction
local / global

IdeaRS.OpenModel.Detail.LineSupport.GeometryPointsPath
list of line load points

IdeaRS.OpenModel.Detail.LineSupport.OnWallEdge
true to add line support on wall edge

IdeaRS.OpenModel.Detail.LineSupport.GeomId
Id representing geometrical parts of Detail

IdeaRS.OpenModel.Detail.LineSupport.MasterComponent
Gets or sets the master component

IdeaRS.OpenModel.Detail.LineSupport.MasterEdge
master component edge

IdeaRS.OpenModel.Detail.LineSupport.TypeEdgePosition
edge position type

IdeaRS.OpenModel.Detail.LineSupport.EdgePositionType
edge position type

IdeaRS.OpenModel.Detail.LineSupport.PositionOnEdge
position od edge

IdeaRS.OpenModel.Detail.LineSupport.SupportLength
support lengtj

IdeaRS.OpenModel.Detail.LineSupport.GeneralLine
general shape